#forms.py
from wtforms import PasswordField, StringField, SubmitField, IntegerField
from wtforms.validators import EqualTo, Email, DataRequired, Length
from flask_wtf import FlaskForm
from wtforms import StringField, TextAreaField, SubmitField, SelectField


region_choices = [
        ('Республика Адыгея', 'Республика Адыгея'),
        ('Республика Алтай', 'Республика Алтай'),
        ('Республика Башкортостан', 'Республика Башкортостан'),
        ('Республика Бурятия', 'Республика Бурятия'),
        ('Республика Дагестан', 'Республика Дагестан'),
        ('Республика Ингушетия', 'Республика Ингушетия'),
        ('Республика Кабардино-Балкария', 'Республика Кабардино-Балкария'),
        ('Республика Калмыкия', 'Республика Калмыкия'),
        ('Республика Карачаево-Черкесия', 'Республика Карачаево-Черкесия'),
        ('Республика Карелия', 'Республика Карелия'),
        ('Республика Коми', 'Республика Коми'),
        ('Республика Крым', 'Республика Крым'),
        ('Республика Марий Эл', 'Республика Марий Эл'),
        ('Республика Мордовия', 'Республика Мордовия'),
        ('Республика Саха (Якутия)', 'Республика Саха (Якутия)'),
        ('Республика Северная Осетия — Алания', 'Республика Северная Осетия — Алания'),
        ('Республика Татарстан', 'Республика Татарстан'),
        ('Республика Тыва', 'Республика Тыва'),
        ('Республика Хакасия', 'Республика Хакасия'),
        ('Чеченская республика', 'Чеченская республика'),
        ('Чувашская Республика', 'Чувашская Республика'),
        ('Краснодарский край', 'Краснодарский край'),
        ('Красноярский край', 'Красноярский край'),
        ('Приморский край', 'Приморский край'),
        ('Ставропольский край', 'Ставропольский край'),
        ('Хабаровский край', 'Хабаровский край'),
        ('Алтайский край', 'Алтайский край'),
        ('Амурская область', 'Амурская область'),
        ('Архангельская область', 'Архангельская область'),
        ('Астраханская область', 'Астраханская область'),
        ('Белгородская область', 'Белгородская область'),
        ('Брянская область', 'Брянская область'),
        ('Владимирская область', 'Владимирская область'),
        ('Волгоградская область', 'Волгоградская область'),
        ('Вологодская область', 'Вологодская область'),
        ('Воронежская область', 'Воронежская область'),
        ('Ивановская область', 'Ивановская область'),
        ('Иркутская область', 'Иркутская область'),
        ('Калининградская область', 'Калининградская область'),
        ('Калужская область', 'Калужская область'),
        ('Камчатский край', 'Камчатский край'),
        ('Кемеровская область', 'Кемеровская область'),
        ('Кировская область', 'Кировская область'),
        ('Костромская область', 'Костромская область'),
        ('Курганская область', 'Курганская область'),
        ('Курская область', 'Курская область'),
        ('Ленинградская область', 'Ленинградская область'),
        ('Липецкая область', 'Липецкая область'),
        ('Магаданская область', 'Магаданская область'),
        ('Московская область', 'Московская область'),
        ('Мурманская область', 'Мурманская область'),
        ('Нижегородская область', 'Нижегородская область'),
        ('Новгородская область', 'Новгородская область'),
        ('Новосибирская область', 'Новосибирская область'),
        ('Омская область', 'Омская область'),
        ('Оренбургская область', 'Оренбургская область'),
        ('Орловская область', 'Орловская область'),
        ('Пензенская область', 'Пензенская область'),
        ('Пермский край', 'Пермский край'),
        ('Псковская область', 'Псковская область'),
        ('Ростовская область', 'Ростовская область'),
        ('Рязанская область', 'Рязанская область'),
        ('Самарская область', 'Самарская область'),
        ('Саратовская область', 'Саратовская область'),
        ('Сахалинская область', 'Сахалинская область'),
        ('Свердловская область', 'Свердловская область'),
        ('Смоленская область', 'Смоленская область'),
        ('Тамбовская область', 'Тамбовская область'),
        ('Тверская область', 'Тверская область'),
        ('Томская область', 'Томская область'),
        ('Тульская область', 'Тульская область'),
        ('Тюменская область', 'Тюменская область'),
        ('Ульяновская область', 'Ульяновская область'),
        ('Челябинская область', 'Челябинская область'),
        ('Забайкальский край', 'Забайкальский край'),
        ('Москва', 'Москва'),
        ('Санкт-Петербург', 'Санкт-Петербург'),
        ('Севастополь', 'Севастополь'),
        ('Еврейская автономная область', 'Еврейская автономная область'),
        ('Агинский Бурятский автономный округ', 'Агинский Бурятский автономный округ'),
    ]

class RegistrationForm(FlaskForm):
    firstname = StringField('Имя пользователя', validators=[DataRequired(), Length(min=2, max=20)])
    lastname = StringField('Фамилия пользователя', validators=[DataRequired(), Length(min=2, max=20)])
    age = StringField('Возраст', validators=[DataRequired(), Length(min=1, max=3)])
    region = SelectField('Регион', choices=region_choices, validators=[DataRequired()])

    email = StringField('Email', validators=[DataRequired(), Email()])
    password = PasswordField('Пароль', validators=[DataRequired()])
    confirm_password = PasswordField('Подтвердите пароль', validators=[DataRequired(), EqualTo('password')])
    submit = SubmitField('Зарегистрироваться')


class LoginForm(FlaskForm):
    email = StringField('Email', validators=[DataRequired(), Email()])
    password = PasswordField('Пароль', validators=[DataRequired()])
    submit = SubmitField('Войти')



from flask_wtf import FlaskForm
from wtforms import StringField, SubmitField
from wtforms.validators import DataRequired


class RegionForm(FlaskForm):
    region = SelectField('Выберите регион', choices=region_choices)
    submit = SubmitField('Показать вакансии')


class EditProfileForm(FlaskForm):
    firstname = StringField('Имя', validators=[DataRequired()])
    lastname = StringField('Фамилия', validators=[DataRequired()])
    region = SelectField('Регион', choices=region_choices, validators=[DataRequired()])
    age = IntegerField('Возраст', validators=[DataRequired()])
    email = StringField('Email', validators=[DataRequired(), Email()])
    submit = SubmitField('Сохранить изменения')



